In [1]:
import pandas as pd
from pandas import Series, DataFrame
import pandas as pd

In [2]:
# index object
my_ser = Series([1,2,3,4], index=['a','b','c','d'])

In [3]:
my_ser

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
my_index = my_ser.index

In [5]:
my_index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
my_index[2]

'c'

In [8]:
my_index[:]

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
my_index[1:]

Index(['b', 'c', 'd'], dtype='object')

In [10]:
my_index[0]

'a'

Reindexing

In [11]:
import pandas as pd
import numpy as np
from numpy.random import randn
from pandas import Series, DataFrame

In [13]:
ser1= Series([1,2,3,4],index=['a','b','c','d'])

In [14]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
ser2 = ser1.reindex(['a','b','c','d','e','f']) #Reindexing 
ser2

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
dtype: float64

In [17]:
ser2.reindex(['a','b','c','d','e','f','g'],fill_value = 0)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
g    0.0
dtype: float64

In [18]:
ser3=Series(['Nepal','Indea','China'],index=[1,2,3])
ser3

1    Nepal
2    Indea
3    China
dtype: object

In [25]:
ranger = range(15)
ranger

range(0, 15)

In [27]:
ser3.reindex(ranger, method='ffill')

0       NaN
1     Nepal
2     Indea
3     China
4     China
5     China
6     China
7     China
8     China
9     China
10    China
11    China
12    China
13    China
14    China
dtype: object

In [29]:
dframe = DataFrame(randn(25).reshape((5,5)),index =['A','B','C','D','G'], 
                   columns =['coll','coll2','coll3','coll4','coll5'])
dframe

       coll     coll2     coll3     coll4     coll5
A -0.016401 -1.519209 -1.819083 -1.316766 -1.306786
B -0.487325  0.856277 -0.390868  0.135450 -0.840662
C  0.190643 -0.486263 -0.610963  1.260969  2.188594
D  0.396136 -0.720527 -0.232189  0.652350  0.673481
G -0.850217  0.253617 -0.657770 -1.298757  2.207313

In [33]:
dframe2 = dframe.reindex(['A','B','C','E'])

In [34]:
dframe2

       coll     coll2     coll3     coll4     coll5
A -0.016401 -1.519209 -1.819083 -1.316766 -1.306786
B -0.487325  0.856277 -0.390868  0.135450 -0.840662
C  0.190643 -0.486263 -0.610963  1.260969  2.188594
E       NaN       NaN       NaN       NaN       NaN

In [35]:
new_colums = ['coll','coll2','coll3','coll4','coll5','coll6']

In [38]:
dframe2.reindex(columns = new_colums)

       coll     coll2     coll3     coll4     coll5  coll6
A -0.016401 -1.519209 -1.819083 -1.316766 -1.306786    NaN
B -0.487325  0.856277 -0.390868  0.135450 -0.840662    NaN
C  0.190643 -0.486263 -0.610963  1.260969  2.188594    NaN
E       NaN       NaN       NaN       NaN       NaN    NaN

In [42]:
dframe

       coll     coll2     coll3     coll4     coll5
A -0.016401 -1.519209 -1.819083 -1.316766 -1.306786
B -0.487325  0.856277 -0.390868  0.135450 -0.840662
C  0.190643 -0.486263 -0.610963  1.260969  2.188594
D  0.396136 -0.720527 -0.232189  0.652350  0.673481
G -0.850217  0.253617 -0.657770 -1.298757  2.207313

DROping entries from data frame

In [49]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [51]:
ser1 = Series(np.arange(3),index=['a','b','c'])

In [52]:
ser1

a    0
b    1
c    2
dtype: int64

In [55]:
ser1.drop('a')

b    1
c    2
dtype: int64

In [63]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],
                                                columns =['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [72]:
dframe2=dframe1.drop('LA')

In [73]:
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [75]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [76]:
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

Selecting Entries

In [77]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [78]:
ser1 = Series(np.arange(3), index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int64

In [79]:
ser1['B']

2

In [80]:
ser1[1]

/var/folders/j0/w_nkzt051mn4tt9zkz40drc80000gp/T/ipykernel_42769/2158219610.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser1[1]

2

In [81]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [82]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [83]:
ser1[ser1>3]

C    4
dtype: int64

In [84]:
ser1[ser1>3]=10
ser1

A     0
B     2
C    10
dtype: int64

In [86]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index =['NYC','LA','SF','DC','CHI'],
                                         columns=['A','B','C','D','E'])

In [87]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [88]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int64

In [90]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [91]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [93]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [94]:
dframe >10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [96]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

Data alighment

In [100]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [105]:
ser1 = Series([0,1,2],index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [108]:
ser2 = Series([3,4,5,6],index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [109]:
ser1 +ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [112]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])

In [113]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [117]:
dframe = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])

In [118]:
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [119]:
dframe1+dframe2

      A   B  pop  size  year
LA  NaN NaN  NaN   NaN   NaN
NY  NaN NaN  NaN   NaN   NaN
NYC NaN NaN  NaN   NaN   NaN
SF  NaN NaN  NaN   NaN   NaN

In [120]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [122]:
dframe1.add(dframe2,fill_value=0)

       A    B  pop  size  year
LA   2.0  3.0  NaN   NaN   NaN
NY   NaN  NaN  6.0   7.0   8.0
NYC  0.0  1.0  NaN   NaN   NaN
SF   NaN  NaN  0.0   1.0   2.0